1C/DataProcessors/EPA_ПанельАдминистрирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>EPA_ПанельАдминистрирования</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.EPA_Пользователь</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтегрированСEPAction</Name>
							<Comment>Интегрирован c Easy peasy action</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сложность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EPA_СложностьЗаданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Устройство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.EPA_УстройстваПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

1C/InformationRegisters/EPA_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>EPA_НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИнтегрированСEPAction</Name>
					<Comment>Интегрирован  c Easy peasy action</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложностьЗаданий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EPA_СложностьЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EPA_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EPA_УстройстваПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.EPA_Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1C/DataProcessors/EPA_ПанельАдминистрирования/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТокенДоступаПолучен = ЗначениеЗаполнено(ПараметрыСеанса.EPA_ТокенДоступа);
    ЗаполнитьПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)     
	
	Если НЕ ТокенДоступаПолучен Тогда 
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ТаблицаПользователи.Видимость = Ложь;
	КонецЕсли;     
	
КонецПроцедуры 

&НаКлиенте
Процедура ОО_ЗаверешениеАвторизации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли; 
	
	Если РезультатЗакрытия Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
		Элементы.ФормаАвторизоваться.Видимость = Ложь;
		Элементы.ТаблицаПользователи.Видимость = Истина;
		Возврат;
	Иначе
		ЭтаФорма.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Авторизоваться(Команда)
	
	ЗаверешениеАвторизации = Новый ОписаниеОповещения("ОО_ЗаверешениеАвторизации", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.EPA_ФормаАвторизации", , ЭтаФорма,,,, ЗаверешениеАвторизации);	
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПользователей()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь,
		|	EPA_НастройкиПользователей.ИнтегрированСEPAction КАК ИнтегрированСEPAction,
		|	EPA_НастройкиПользователей.СложностьЗаданий КАК Сложность,
		|	EPA_НастройкиПользователей.Устройство КАК Устройство
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.EPA_НастройкиПользователей КАК EPA_НастройкиПользователей
		|		ПО Пользователи.Ссылка = EPA_НастройкиПользователей.Пользователь";
	
	РезультатЗапроса = Запрос.Выполнить();
	Данные = РезультатЗапроса.Выгрузить();
	
	Объект.ТаблицаПользователи.Загрузить(Данные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегеистрироватьПользователей(Команда)   
	
	МассивВыделенныхСтрок = Элементы.ТаблицаПользователи.ВыделенныеСтроки; 
	МассивПользователей = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из МассивВыделенныхСтрок Цикл
		СтрокаДанных = Объект.ТаблицаПользователи.НайтиПоИдентификатору(ВыделеннаяСтрока); 
		
		Если НЕ СтрокаДанных.ИнтегрированСEPAction Тогда 
			МассивПользователей.Добавить(Новый Структура("Пользователь, УровеньЗаданй", СтрокаДанных.Пользователь, СтрокаДанных.Сложность));
		КонецЕсли;
		
	КонецЦикла;
	
	EPA_ВзаимодействиеHTTP.ЗарегестироватьМассивПользователей(МассивПользователей);
	
	ОбновитьДанныеПользователей(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПользователя(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьУстройство(Команда)
	
	Если Элементы.ТаблицаПользователи.ТекущиеДанные.ИнтегрированСEPAction Тогда
		ОткрытьФорму("ОбщаяФорма.EPA_ФормаГенерацииКода",, ЭтаФорма);
	Иначе
		ПоказатьПредупреждение(, "Операция запрещена для не зарегестрированного пользователя!", 10, "Операция запрещена!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПользователей(Команда)
	Результат = EPA_ВзаимодействиеHTTP.ЗапроситьДанныеПользователей();
	Если Результат.Успешно Тогда
		ЗаполнитьПользователей();	
	КонецЕсли;
КонецПроцедуры
